
&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СрокПросрочен.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПисьмо(Команда)
	СсылкаНаЭлемент = Элементы.СрокПросрочен.ТекущиеДанные;
	
	ДанныеЗаполнения = Новый Структура("АктПередачи",СсылкаНаЭлемент.АктПередачи);
	
	СоздатьПисьмоСервер(ДанныеЗаполнения);
	
	Элементы.ИнформацияПоПисьмам.Обновить();
КонецПроцедуры 

Функция СоздатьПисьмоСервер(Данные)
	
	ДокПисьмо = Документы.otus_ПисьмоПретензии.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(ДокПисьмо,Данные);
	
	ДокПисьмо.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	ДокПисьмо.Дата = ТекущаяДата();
	
	ДокПисьмо.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции	


&НаКлиенте
Процедура ОбновитьПисьма(Команда)
	Элементы.ИнформацияПоПисьмам.Обновить();
КонецПроцедуры

