

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	НаборЗаписей = РегистрыСведений.otus_СписокПисем.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	
	НовЗапись = НаборЗаписей.Добавить();
	
	НовЗапись.Письмо = ЭтотОбъект.Ссылка;
	НовЗапись.Период  = ТекущаяДата();
	НовЗапись.Ответственный = ПараметрыСеанса.ТекущийПользователь; 
	НовЗапись.Статус = Перечисления.otus_СтатусОтправки.КОтправке;
	НаборЗаписей.Записать(Истина);
	
	Акт = ЭтотОбъект.АктПередачи.ПолучитьОбъект();
	
	Акт.Статус = Перечисления.otus_СтатусАкта.НеВозвращено;
	
	Акт.Записать(РежимЗаписиДокумента.Запись);
	
	НовЗапись.Контрагент = Акт.Контрагент;
	
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

