
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	 СтруктураДат = ДоговорПриИзмененииСервер();
	 
	 ЗаполнитьЗначенияСвойств(Объект,СтруктураДат);
	
 КонецПроцедуры 
 
 Функция ДоговорПриИзмененииСервер()
	 
	 СтруктураДат = Новый Структура;
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "
	 |ВЫБРАТЬ
	 |	otus_Договор.ДатаПередачиТовара КАК ДатаПередачиТовара,
	 |	otus_Договор.КоличествоДней КАК КоличествоДней
	 |ИЗ
	 |	Справочник.otus_Договор КАК otus_Договор
	 |ГДЕ
	 |	otus_Договор.Ссылка = &Ссылка
	 |"; 
	 
	 Запрос.УстановитьПараметр("Ссылка",Объект.Договор);
	 
	 РезультатЗапроса = Запрос.Выполнить().Выбрать();
	 
	 Пока РезультатЗапроса.Следующий() Цикл
		 
		  ДатаВозрата = РезультатЗапроса.ДатаПередачиТовара+86400*РезультатЗапроса.КоличествоДней;
		  СтруктураДат = Новый Структура("ДатаПередачи,ДатаВозврата",РезультатЗапроса.ДатаПередачиТовара,ДатаВозрата);
		  
		  Возврат СтруктураДат;
	КонецЦикла;	 
	 
 КонецФункции 
