
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварныеЗапасы.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ТоварныеЗапасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокТоваров.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Дата) Тогда
		ЭтотОбъект.Дата = ТекущаяДата();
	КонецЕСли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ЭтотОбъект.Статус = Перечисления.otus_СтатусАкта.Формируется
		И ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
		ЭтотОбъект.Статус = Перечисления.otus_СтатусАкта.Передано;
	КонецЕсли;	
КонецПроцедуры
